# Pandas
Pandas is a python library built on top of Numpy, used for data manipulation and analysis.
## Pandas series vs pandas dataframes
A pandas series is a 1d array-like object that can hold many data types.
Pandas series are mutable

In [1]:
import pandas as pd

In [2]:
#creating a pandas series
groceries = pd.Series(data = [30, 6, 'Yes', 'No'], index = ['eggs', 'apples', 'milk', 'bread'])
groceries

eggs       30
apples      6
milk      Yes
bread      No
dtype: object

In [11]:
print("Groceries has shape:", groceries.shape)
print("Groceries has dimension:", groceries.ndim)
print("Groceries has a total of:", groceries.size, "elements")

Groceries has shape: (4,)
Groceries has dimension: 1
Groceries has a total of: 4 elements

In [12]:
'bananas' in groceries

False

In [13]:
'bread' in groceries

True

## Accessing and deleting elements in Pandas Series

In [14]:
groceries['eggs']

30

In [15]:
groceries[['eggs', 'milk']]

eggs     30
milk    Yes
dtype: object

In [16]:
groceries[0]

30

In [17]:
groceries[3]

'No'

In [18]:
groceries['eggs'] = 12
groceries

eggs       12
apples      6
milk      Yes
bread      No
dtype: object

In [19]:
groceries.drop('apples')
# returns a modified version of the series without changing it

eggs      12
milk     Yes
bread     No
dtype: object

In [20]:
groceries

eggs       12
apples      6
milk      Yes
bread      No
dtype: object

In [21]:
groceries.drop('apples', inplace = True)
# deletes the element and modifies the series
groceries

eggs      12
milk     Yes
bread     No
dtype: object

# Arithmetic operations on Pandas Series

In [4]:
fruits = pd.Series([10, 6, 3], ['apples', 'oranges', 'bananas'])
fruits

apples     10
oranges     6
bananas     3
dtype: int64

In [23]:
print(fruits + 2)

apples     12
oranges     8
bananas     5
dtype: int64

In [24]:
print(fruits - 2)

apples     8
oranges    4
bananas    1
dtype: int64

In [25]:
print(fruits * 2)

apples     20
oranges    12
bananas     6
dtype: int64

In [26]:
print(fruits - 2)

apples     8
oranges    4
bananas    1
dtype: int64

In [5]:
import numpy as np
np.sqrt(fruits)

apples     3.162278
oranges    2.449490
bananas    1.732051
dtype: float64

In [28]:
ny.power(fruits, 2)

apples     100
oranges     36
bananas      9
dtype: int64

In [29]:
np.exp(fruits)

apples     22026.465795
oranges      403.428793
bananas       20.085537
dtype: float64

In [30]:
fruits[['bananas']] + 2

bananas    5
dtype: int64

# Pandas dataframes
Pandas dataframe is a 2d object with labelled rows and columns which can also hold multiple datatypes

In [31]:
items = {'Bob': pd.Series([245, 25, 55], index = ['bike', 'pants', 'watch']), 
         'Alice': pd.Series([40, 10, 500, 45], index = ['book', 'glasses', 'bike', 'pants'])}
type(items)

dict

In [32]:
shopping_carts = pd.DataFrame(items)
shopping_carts

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN   10.0
pants     25.0   45.0
watch     55.0    NaN

In [33]:
data = {'Bob' : pd.Series([245, 25, 55]),
        'Alice' : pd.Series([40, 110, 500, 45])}
df = pd.DataFrame(data)
df

     Bob  Alice
0  245.0     40
1   25.0    110
2   55.0    500
3    NaN     45

In [34]:
bob_shopping_cart = pd.DataFrame(items, columns = ['Bob'])
bob_shopping_cart

       Bob
bike   245
pants   25
watch   55

In [35]:
sel_shopping_cart = pd.DataFrame(items, index = ['pants', 'book'])
sel_shopping_cart

        Bob  Alice
pants  25.0     45
book    NaN     40

In [36]:
shopping_carts.shape

(5, 2)

In [37]:
alice_shopping_cart = pd.DataFrame(items, index = ['pants', 'book'], columns = ['Bob'])
alice_shopping_cart

        Bob
pants  25.0
book    NaN

In [38]:
# creating a dataframe with labelled indices
data = {'Integers': [1, 2, 3], 'Floats': [2.4, 9.0, 5.6]}
df = pd.DataFrame(data, index = ['Label 1', 'Label 2', 'Label 3'])
df

         Integers  Floats
Label 1         1     2.4
Label 2         2     9.0
Label 3         3     5.6

# Accessing elements in Pandas dataframes

In [39]:
items = [{'bikes': 20, 'pants': 30, 'watches': 35}, {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants': 5}]
store_items = pd.DataFrame(items, index = ['store 1', 'store 2'])
store_items

         bikes  pants  watches  glasses
store 1     20     30       35      NaN
store 2     15      5       10     50.0

In [40]:
store_items['bikes']

store 1    20
store 2    15
Name: bikes, dtype: int64

In [41]:
store_items['bikes']['store 2']

15

The main diff b/w the 'loc' and 'iloc' methods is that loc gets rows (and/or columns) with particular labels while iloc gets rows (and/or columns) at integer locations.

In [42]:
store_items.loc[['store 1']]
# returns as a dataframe

         bikes  pants  watches  glasses
store 1     20     30       35      NaN

In [43]:
store_items.loc['store 1']
# returns a listing of the elements

bikes      20.0
pants      30.0
watches    35.0
glasses     NaN
Name: store 1, dtype: float64

In [44]:
store_items['shirts'] = [15, 8]
store_items

         bikes  pants  watches  glasses  shirts
store 1     20     30       35      NaN      15
store 2     15      5       10     50.0       8

In [45]:
store_items['suits'] = store_items['shirts'] + store_items['pants']
store_items

         bikes  pants  watches  glasses  shirts  suits
store 1     20     30       35      NaN      15     45
store 2     15      5       10     50.0       8     13

In [46]:
new_items = [{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4}]
new_store = pd.DataFrame(new_items, index = ['store 3'])
new_store

         bikes  pants  watches  glasses
store 3     20     30       35        4

In [47]:
store_items = store_items.append(new_store)
store_items
#'append' is outdated and pd.concat() is now used

C:\Users\ashpr\AppData\Local\Temp\ipykernel_12312\270667583.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  store_items = store_items.append(new_store)

         bikes  pants  watches  glasses  shirts  suits
store 1     20     30       35      NaN    15.0   45.0
store 2     15      5       10     50.0     8.0   13.0
store 3     20     30       35      4.0     NaN    NaN

In [48]:
print(pd.concat([store_items, new_store]))

         bikes  pants  watches  glasses  shirts  suits
store 1     20     30       35      NaN    15.0   45.0
store 2     15      5       10     50.0     8.0   13.0
store 3     20     30       35      4.0     NaN    NaN
store 3     20     30       35      4.0     NaN    NaN

In [49]:
store_items['new_watches'] = store_items['watches'][1:]
store_items

         bikes  pants  watches  glasses  shirts  suits  new_watches
store 1     20     30       35      NaN    15.0   45.0          NaN
store 2     15      5       10     50.0     8.0   13.0         10.0
store 3     20     30       35      4.0     NaN    NaN         35.0

In [50]:
store_items.insert(5, 'shoes', [2, 5, 0])
store_items

         bikes  pants  watches  glasses  shirts  shoes  suits  new_watches
store 1     20     30       35      NaN    15.0      2   45.0          NaN
store 2     15      5       10     50.0     8.0      5   13.0         10.0
store 3     20     30       35      4.0     NaN      0    NaN         35.0

'pop' is used to delete columns, 'drop' is used to delete both rows and columns by making use of the 'axis' keyword

In [51]:
store_items.insert(4, 'socks', [13, 9, 1])
store_items

,bikes,pants,watches,glasses,socks,shirts,shoes,suits,new_watches
store 1,20,30,35,NaN,13,15.0,2,45.0,NaN
store 2,15,5,10,50.0,9,8.0,5,13.0,10.0
store 3,20,30,35,4.0,1,NaN,0,NaN,35.0

In [52]:
store_items.pop('new_watches')
store_items

         bikes  pants  watches  glasses  socks  shirts  shoes  suits
store 1     20     30       35      NaN     13    15.0      2   45.0
store 2     15      5       10     50.0      9     8.0      5   13.0
store 3     20     30       35      4.0      1     NaN      0    NaN

In [53]:
store_items = store_items.drop(['socks'], axis = 1)
store_items

         bikes  pants  watches  glasses  shirts  shoes  suits
store 1     20     30       35      NaN    15.0      2   45.0
store 2     15      5       10     50.0     8.0      5   13.0
store 3     20     30       35      4.0     NaN      0    NaN

In [54]:
store_items = store_items.drop(['store 3'], axis = 0)
store_items

         bikes  pants  watches  glasses  shirts  shoes  suits
store 1     20     30       35      NaN    15.0      2   45.0
store 2     15      5       10     50.0     8.0      5   13.0

In [55]:
# to rename a datafram row/column, use a dict with key as old name, value as new name
store_items = store_items.rename(columns = {'shoes': 'hats'})
store_items

         bikes  pants  watches  glasses  shirts  hats  suits
store 1     20     30       35      NaN    15.0     2   45.0
store 2     15      5       10     50.0     8.0     5   13.0

In [56]:
store_items = store_items.rename(index = {'store 2': 'last store'})
store_items

            bikes  pants  watches  glasses  shirts  hats  suits
store 1        20     30       35      NaN    15.0     2   45.0
last store     15      5       10     50.0     8.0     5   13.0

# Dealing with NaN
NaN stands for "not a number" and refers to  missing values in our dataset.

In [57]:
items = [{'bikes': 20, 'pants': 30, 'watches': 35, 'shirts': 15, 'shoes':8, 'suits':45},
{'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5, 'shirts': 2, 'shoes':5, 'suits':7},
{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shoes':10}]
store_items = pd.DataFrame(items, index = ['store 1', 'store 2', 'store 3'])
store_items = store_items.sort_index(axis = 1)
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN     10    NaN       35

In [58]:
x = store_items.isnull()
print(x)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1  False     True  False   False  False  False    False
store 2  False    False  False   False  False  False    False
store 3  False    False  False    True  False   True    False

In [59]:
x = store_items.isnull().sum()
print(x)

bikes      0
glasses    1
pants      0
shirts     1
shoes      0
suits      1
watches    0
dtype: int64

In [60]:
x = store_items.isnull().sum().sum()
print(x)

3

Use dropna to drop rows/columns with NaN values by specifying the axis (0 for rows, 1 for columns)

In [61]:
store_items.dropna(axis = 0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 2     15     50.0      5     2.0      5    7.0       10

In [62]:
store_items.dropna(axis = 1)

         bikes  pants  shoes  watches
store 1     20     30      8       35
store 2     15      5      5       10
store 3     20     30     10       35

This however does not modify the original dataframe. To do so, make use of the keyword "inplace" (inplace = True)

In [63]:
store_items.fillna(0)
# replace NaN values by a zero

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      0.0     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     0.0     10    0.0       35

In [64]:
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN     10    NaN       35

We can also use 'ffill' or 'backfill' to replace Nan values either by rows or columns.

ffill stands for forward fill which replaces the NaN by the vlue in front it.

Backfill stands for backward fill which replaces the NaN value by the value after it.

We can also use linear interpolation by making use of the  interpolate method to replaace the NaN value.

All the methods replace the NaN value without modifying the original dataframe.

In [65]:
store_items.fillna(method = 'ffill', axis = 0)

# replace NaN values by the value in their preceding row

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     2.0     10    7.0       35

In [66]:
store_items.fillna(method = 'ffill', axis = 1)
# replace NaN values by the value in their preceding column

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1   20.0     20.0   30.0    15.0    8.0   45.0     35.0
store 2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store 3   20.0      4.0   30.0    30.0   10.0   10.0     35.0

In [67]:
store_items.fillna(method = 'backfill', axis = 0)
# replace NaN values by the value in their preceding row

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20     50.0     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN     10    NaN       35

In [68]:
store_items.fillna(method = 'backfill', axis = 1)
# replace NaN values by the value in their preceding column

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1   20.0     30.0   30.0    15.0    8.0   45.0     35.0
store 2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store 3   20.0      4.0   30.0    10.0   10.0   35.0     35.0

In [69]:
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN     10    NaN       35

In [70]:
store_items.interpolate(method="linear", axis = 0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     2.0     10    7.0       35

## Sample exercise on pandas dataframe manipulation

In [71]:
import numpy as np

In [72]:
books = pd.Series(data = ['Great Expectations', 'Of Mice and Men', 'Romeo and Juliet', 'The Time Machine', 'Alice in Wonderland' ])
authors = pd.Series(data = ['Charles Dickens', 'John Steinbeck', 'William Shakespeare', ' H. G. Wells', 'Lewis Carroll' ])
user_1 = pd.Series(data = [3.2, np.nan ,2.5])
user_2 = pd.Series(data = [5., 1.3, 4.0, 3.8])
user_3 = pd.Series(data = [2.0, 2.3, np.nan, 4])
user_4 = pd.Series(data = [4, 3.5, 4, 5, 4.2])

In [73]:
dat = {'Book Title' : books, 'Author' : authors, 'User 1' : user_1, 'User 2' : user_2, 'User 3' : user_3, 'User 4' : user_4}

In [74]:
book_ratings = pd.DataFrame(dat)

In [75]:
book_ratings.fillna(book_ratings.mean(), inplace = True)

C:\Users\ashpr\AppData\Local\Temp\ipykernel_12312\125600252.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  book_ratings.fillna(book_ratings.mean(), inplace = True)

In [76]:
book_ratings

            Book Title               Author  User 1  User 2    User 3  User 4
0   Great Expectations      Charles Dickens    3.20   5.000  2.000000     4.0
1      Of Mice and Men       John Steinbeck    2.85   1.300  2.300000     3.5
2     Romeo and Juliet  William Shakespeare    2.50   4.000  2.766667     4.0
3     The Time Machine          H. G. Wells    2.85   3.800  4.000000     5.0
4  Alice in Wonderland        Lewis Carroll    2.85   3.525  2.766667     4.2

In [77]:
best_rated = book_ratings[(book_ratings == 5).any(axis = 1)]['Book Title'].values

In [78]:
best_rated

array(['Great Expectations', 'The Time Machine'], dtype=object)

## Explanation of solution
#### Step 1 - Highlight the rows containing a value = 5. 
This step will replace all values != 5 with NaN in the entire DataFrame. 
best_rated = book_ratings[(book_ratings == 5)]

#### Step 2 - Extract the DataFrame containing only those rows that have a value = 5. 
best_rated = book_ratings[(book_ratings == 5).any(axis = 1)]

#### Step 3 - Find the corresponding Book Title of the rows identified above. 
#### Returns a numpy.ndarray containing only the Book Titles
best_rated = book_ratings[(book_ratings == 5).any(axis = 1)]['Book Title'].values

# Loading data into a pandas dataframe
We will look at how to load data from another source like a PDF or CSV file into a pandas dataframe where we can analyze the data using pandas tools.

The most common format used to load data from external sources into a pandas dataframe

In [81]:
google_stock = pd.read_csv('goog-1.csv')
print(type(google_stock))
print(google_stock.shape)

<class 'pandas.core.frame.DataFrame'>
(3313, 7)

In [82]:
google_stock

,Date,Open,High,Low,Close,Adj Close,Volume
0,2004-08-19,49.676899,51.693783,47.669952,49.845802,49.845802,44994500
1,2004-08-20,50.178635,54.187561,49.925285,53.805050,53.805050,23005800
2,2004-08-23,55.017166,56.373344,54.172661,54.346527,54.346527,18393200
3,2004-08-24,55.260582,55.439419,51.450363,52.096165,52.096165,15361800
4,2004-08-25,52.140873,53.651051,51.604362,52.657513,52.657513,9257400
...,...,...,...,...,...,...,...
3308,2017-10-09,980.000000,985.424988,976.109985,977.000000,977.000000,891400
3309,2017-10-10,980.000000,981.570007,966.080017,972.599976,972.599976,968400
3310,2017-10-11,973.719971,990.710022,972.250000,989.250000,989.250000,1693300
3311,2017-10-12,987.450012,994.119995,985.000000,987.830017,987.830017,1262400
3312,2017-10-13,992.000000,997.210022,989.000000,989.679993,989.679993,1157700

In [83]:
google_stock.head(8)

         Date       Open       High        Low      Close  Adj Close    Volume
0  2004-08-19  49.676899  51.693783  47.669952  49.845802  49.845802  44994500
1  2004-08-20  50.178635  54.187561  49.925285  53.805050  53.805050  23005800
2  2004-08-23  55.017166  56.373344  54.172661  54.346527  54.346527  18393200
3  2004-08-24  55.260582  55.439419  51.450363  52.096165  52.096165  15361800
4  2004-08-25  52.140873  53.651051  51.604362  52.657513  52.657513   9257400
5  2004-08-26  52.135906  53.626213  51.991844  53.606342  53.606342   7148200
6  2004-08-27  53.700729  53.959049  52.503513  52.732029  52.732029   6258300
7  2004-08-30  52.299839  52.404160  50.675404  50.675404  50.675404   5235700

In [84]:
google_stock.isnull().any()

Date         False
Open         False
High         False
Low          False
Close        False
Adj Close    False
Volume       False
dtype: bool

In [87]:
google_stock.describe()

,Open,High,Low,Close,Adj Close,Volume
count,3313.000000,3313.000000,3313.000000,3313.000000,3313.000000,3.313000e+03
mean,380.186092,383.493740,376.519309,380.072458,380.072458,8.038476e+06
std,223.818650,224.974534,222.473232,223.853780,223.853780,8.399521e+06
min,49.274517,50.541279,47.669952,49.681866,49.681866,7.900000e+03
25%,226.556473,228.394516,224.003082,226.407440,226.407440,2.584900e+06
50%,293.312286,295.433502,289.929291,293.029114,293.029114,5.281300e+06
75%,536.650024,540.000000,532.409973,536.690002,536.690002,1.065370e+07
max,992.000000,997.210022,989.000000,989.679993,989.679993,8.276810e+07

In [88]:
google_stock.max()

Date         2017-10-13
Open              992.0
High         997.210022
Low               989.0
Close        989.679993
Adj Close    989.679993
Volume         82768100
dtype: object

In [90]:
google_stock['Adj Close'].describe()

count    3313.000000
mean      380.072458
std       223.853780
min        49.681866
25%       226.407440
50%       293.029114
75%       536.690002
max       989.679993
Name: Adj Close, dtype: float64

In [91]:
google_stock['Close'].min()

49.681866

In [92]:
google_stock.corr()

               Open      High       Low     Close  Adj Close    Volume
Open       1.000000  0.999904  0.999845  0.999745   0.999745 -0.564258
High       0.999904  1.000000  0.999834  0.999868   0.999868 -0.562749
Low        0.999845  0.999834  1.000000  0.999899   0.999899 -0.567007
Close      0.999745  0.999868  0.999899  1.000000   1.000000 -0.564967
Adj Close  0.999745  0.999868  0.999899  1.000000   1.000000 -0.564967
Volume    -0.564258 -0.562749 -0.567007 -0.564967  -0.564967  1.000000

In [93]:
data = pd.read_csv('fake-company.csv')
data

   Year     Name Department  Age  Salary
0  1990    Alice         HR   25   50000
1  1990      Bob         RD   30   48000
2  1990  Charlie      Admin   45   55000
3  1991   Dakota         HR   26   52000
4  1991     Elsa         RD   31   50000
5  1991    Frank      Admin   46   60000
6  1992    Grace      Admin   27   60000
7  1992  Hoffman         RD   32   52000
8  1992    Inaar      Admin   28   62000

In [95]:
data.groupby(['Year'])['Salary'].sum()

Year
1990    153000
1991    162000
1992    174000
Name: Salary, dtype: int64

In [97]:
data.groupby(['Name'])['Salary'].sum()

Name
Alice      50000
Bob        48000
Charlie    55000
Dakota     52000
Elsa       50000
Frank      60000
Grace      60000
Hoffman    52000
Inaar      62000
Name: Salary, dtype: int64

In [98]:
data.groupby(['Year', 'Department'])['Salary'].sum()

Year  Department
1990  Admin          55000
      HR             50000
      RD             48000
1991  Admin          60000
      HR             52000
      RD             50000
1992  Admin         122000
      RD             52000
Name: Salary, dtype: int64